stress_log/hdd_stress.log
=========== Disks Read and Write Check  2022-01-12 17:07:53 ===============

===================== Building Raid ============================
============== Build Raid Success, Information ==================
makeraid0.sh: line 4: ./storcli64: No such file or directory
makeraid0.sh: line 14: ./storcli64: No such file or directory
makeraid0.sh: line 17: ./storcli64: No such file or directory
NAME            MAJ:MIN RM   SIZE RO TYPE MOUNTPOINT
sda               8:0    0 446.6G  0 disk 
sdb               8:16   0 446.6G  0 disk 
sdc               8:32   0  10.9T  0 disk 
sdd               8:48   0  10.9T  0 disk 
sde               8:64   0  10.9T  0 disk 
sdf               8:80   0  10.9T  0 disk 
sdg               8:96   0  10.9T  0 disk 
sdh               8:112  0  10.9T  0 disk 
sdi               8:128  0  10.9T  0 disk 
sdj               8:144  0  10.9T  0 disk 
sdk               8:160  0  10.9T  0 disk 
sdl               8:176  0  10.9T  0 disk 
nvme0n1         259:1    0   1.5T  0 disk 
├─nvme0n1p1     259:2    0   200M  0 part /boot/efi
├─nvme0n1p2     259:3    0     1G  0 part /boot
└─nvme0n1p3     259:4    0   1.5T  0 part 
  ├─centos-root 253:0    0    50G  0 lvm  /
  ├─centos-swap 253:1    0     4G  0 lvm  [SWAP]
  └─centos-home 253:2    0   1.4T  0 lvm  /home
nvme1n1         259:0    0   1.5T  0 disk 
==================================================================
->>> System Disk is : nvme0n1
->>> Tatol Non-system Disks: 13
->>> Non-system Disks is : 
['/dev/sda', '/dev/sdb', '/dev/sdc', '/dev/sdd', '/dev/sde', '/dev/sdf', '/dev/sdg', '/dev/sdh', '/dev/sdi', '/dev/sdj', '/dev/sdk', '/dev/sdl', '/dev/nvme1n1']
========= Non-System Disk Read And Write Begin  2022-01-12 17:08:01 ==========
Begin NO.1 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sda -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_1

mytest_1: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_1: (groupid=0, jobs=10): err= 0: pid=119966: Wed Jan 12 17:08:23 2022
  read: IOPS=12.4k, BW=193MiB/s (203MB/s)(3863MiB/20001msec)
    clat (usec): min=35, max=2954, avg=532.90, stdev=129.64
     lat (usec): min=35, max=2954, avg=533.01, stdev=129.64
    clat percentiles (usec):
     |  1.00th=[  310],  5.00th=[  375], 10.00th=[  400], 20.00th=[  441],
     | 30.00th=[  469], 40.00th=[  490], 50.00th=[  515], 60.00th=[  537],
     | 70.00th=[  570], 80.00th=[  619], 90.00th=[  701], 95.00th=[  775],
     | 99.00th=[  898], 99.50th=[  947], 99.90th=[ 1074], 99.95th=[ 1467],
     | 99.99th=[ 2540]
   bw (  KiB/s): min=188896, max=206592, per=100.00%, avg=198074.26, stdev=404.04, samples=390
   iops        : min=11806, max=12912, avg=12379.64, stdev=25.25, samples=390
  write: IOPS=12.4k, BW=193MiB/s (202MB/s)(3862MiB/20001msec); 0 zone resets
    clat (usec): min=67, max=1009, avg=274.19, stdev=80.86
     lat (usec): min=67, max=1009, avg=274.47, stdev=80.86
    clat percentiles (usec):
     |  1.00th=[   73],  5.00th=[  115], 10.00th=[  155], 20.00th=[  206],
     | 30.00th=[  239], 40.00th=[  265], 50.00th=[  289], 60.00th=[  310],
     | 70.00th=[  330], 80.00th=[  347], 90.00th=[  367], 95.00th=[  383],
     | 99.00th=[  400], 99.50th=[  408], 99.90th=[  416], 99.95th=[  420],
     | 99.99th=[  529]
   bw (  KiB/s): min=183008, max=215008, per=100.00%, avg=197951.18, stdev=738.96, samples=390
   iops        : min=11438, max=13438, avg=12372.00, stdev=46.19, samples=390
  lat (usec)   : 50=0.24%, 100=1.87%, 250=14.92%, 500=55.00%, 750=24.82%
  lat (usec)   : 1000=3.04%
  lat (msec)   : 2=0.09%, 4=0.02%
  cpu          : usr=0.52%, sys=2.24%, ctx=494410, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=247258,247146,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=193MiB/s (203MB/s), 193MiB/s-193MiB/s (203MB/s-203MB/s), io=3863MiB (4051MB), run=20001-20001msec
  WRITE: bw=193MiB/s (202MB/s), 193MiB/s-193MiB/s (202MB/s-202MB/s), io=3862MiB (4049MB), run=20001-20001msec

Disk stats (read/write):
  sda: ios=244522/244363, merge=0/0, ticks=128867/65427, in_queue=194198, util=99.04%
==================  NO.1 non-system disk End ====================
Begin NO.2 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdb -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_2

mytest_2: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_2: (groupid=0, jobs=10): err= 0: pid=120962: Wed Jan 12 17:08:44 2022
  read: IOPS=12.4k, BW=193MiB/s (203MB/s)(3868MiB/20001msec)
    clat (usec): min=34, max=3060, avg=531.60, stdev=128.45
     lat (usec): min=34, max=3061, avg=531.70, stdev=128.45
    clat percentiles (usec):
     |  1.00th=[  314],  5.00th=[  375], 10.00th=[  400], 20.00th=[  441],
     | 30.00th=[  465], 40.00th=[  490], 50.00th=[  515], 60.00th=[  537],
     | 70.00th=[  570], 80.00th=[  611], 90.00th=[  693], 95.00th=[  766],
     | 99.00th=[  898], 99.50th=[  947], 99.90th=[ 1074], 99.95th=[ 1418],
     | 99.99th=[ 2606]
   bw (  KiB/s): min=188800, max=207072, per=100.00%, avg=198295.79, stdev=401.65, samples=390
   iops        : min=11800, max=12942, avg=12393.49, stdev=25.10, samples=390
  write: IOPS=12.4k, BW=193MiB/s (203MB/s)(3866MiB/20001msec); 0 zone resets
    clat (usec): min=67, max=1387, avg=274.61, stdev=80.52
     lat (usec): min=67, max=1387, avg=274.93, stdev=80.52
    clat percentiles (usec):
     |  1.00th=[   73],  5.00th=[  116], 10.00th=[  155], 20.00th=[  206],
     | 30.00th=[  241], 40.00th=[  269], 50.00th=[  289], 60.00th=[  310],
     | 70.00th=[  326], 80.00th=[  347], 90.00th=[  367], 95.00th=[  383],
     | 99.00th=[  400], 99.50th=[  404], 99.90th=[  416], 99.95th=[  424],
     | 99.99th=[  758]
   bw (  KiB/s): min=183584, max=214976, per=100.00%, avg=198215.38, stdev=726.51, samples=390
   iops        : min=11474, max=13436, avg=12388.46, stdev=45.41, samples=390
  lat (usec)   : 50=0.19%, 100=1.82%, 250=14.90%, 500=55.33%, 750=24.73%
  lat (usec)   : 1000=2.92%
  lat (msec)   : 2=0.09%, 4=0.02%
  cpu          : usr=0.58%, sys=2.27%, ctx=494979, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=247535,247439,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=193MiB/s (203MB/s), 193MiB/s-193MiB/s (203MB/s-203MB/s), io=3868MiB (4056MB), run=20001-20001msec
  WRITE: bw=193MiB/s (203MB/s), 193MiB/s-193MiB/s (203MB/s-203MB/s), io=3866MiB (4054MB), run=20001-20001msec

Disk stats (read/write):
  sdb: ios=245817/245611, merge=0/0, ticks=129004/65863, in_queue=194773, util=99.43%
==================  NO.2 non-system disk End ====================
Begin NO.3 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdc -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_3

mytest_3: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_3: (groupid=0, jobs=10): err= 0: pid=122010: Wed Jan 12 17:09:06 2022
  read: IOPS=383, BW=6141KiB/s (6288kB/s)(120MiB/20060msec)
    clat (usec): min=39, max=316832, avg=25067.58, stdev=27777.51
     lat (usec): min=40, max=316832, avg=25067.75, stdev=27777.51
    clat percentiles (usec):
     |  1.00th=[   570],  5.00th=[  2671], 10.00th=[  3884], 20.00th=[  6194],
     | 30.00th=[  8586], 40.00th=[ 11338], 50.00th=[ 15795], 60.00th=[ 20841],
     | 70.00th=[ 27919], 80.00th=[ 38011], 90.00th=[ 58459], 95.00th=[ 81265],
     | 99.00th=[135267], 99.50th=[152044], 99.90th=[231736], 99.95th=[283116],
     | 99.99th=[316670]
   bw (  KiB/s): min= 2080, max=10752, per=100.00%, avg=6185.48, stdev=207.63, samples=393
   iops        : min=  130, max=  672, avg=386.59, stdev=12.98, samples=393
  write: IOPS=397, BW=6363KiB/s (6516kB/s)(125MiB/20060msec); 0 zone resets
    clat (usec): min=258, max=10320, avg=902.11, stdev=742.80
     lat (usec): min=258, max=10320, avg=902.50, stdev=742.80
    clat percentiles (usec):
     |  1.00th=[  297],  5.00th=[  343], 10.00th=[  400], 20.00th=[  420],
     | 30.00th=[  437], 40.00th=[  486], 50.00th=[  635], 60.00th=[  775],
     | 70.00th=[  988], 80.00th=[ 1270], 90.00th=[ 1778], 95.00th=[ 2376],
     | 99.00th=[ 3752], 99.50th=[ 4293], 99.90th=[ 6652], 99.95th=[ 9110],
     | 99.99th=[10290]
   bw (  KiB/s): min= 1536, max=12960, per=100.00%, avg=6405.42, stdev=273.91, samples=393
   iops        : min=   96, max=  810, avg=400.34, stdev=17.12, samples=393
  lat (usec)   : 50=0.03%, 500=21.29%, 750=9.32%, 1000=6.27%
  lat (msec)   : 2=11.69%, 4=7.07%, 10=12.57%, 20=11.56%, 50=13.87%
  lat (msec)   : 100=4.95%, 250=1.34%, 500=0.04%
  cpu          : usr=0.02%, sys=0.09%, ctx=15700, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7699,7978,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6141KiB/s (6288kB/s), 6141KiB/s-6141KiB/s (6288kB/s-6288kB/s), io=120MiB (126MB), run=20060-20060msec
  WRITE: bw=6363KiB/s (6516kB/s), 6363KiB/s-6363KiB/s (6516kB/s-6516kB/s), io=125MiB (131MB), run=20060-20060msec

Disk stats (read/write):
  sdc: ios=7745/7945, merge=0/0, ticks=191063/7060, in_queue=198487, util=99.50%
==================  NO.3 non-system disk End ====================
Begin NO.4 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdd -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_4

mytest_4: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_4: (groupid=0, jobs=10): err= 0: pid=123630: Wed Jan 12 17:09:28 2022
  read: IOPS=380, BW=6087KiB/s (6233kB/s)(119MiB/20038msec)
    clat (usec): min=38, max=309982, avg=25364.28, stdev=28011.49
     lat (usec): min=38, max=309982, avg=25364.47, stdev=28011.49
    clat percentiles (usec):
     |  1.00th=[   586],  5.00th=[  2671], 10.00th=[  3884], 20.00th=[  6194],
     | 30.00th=[  8586], 40.00th=[ 11207], 50.00th=[ 15664], 60.00th=[ 20579],
     | 70.00th=[ 28181], 80.00th=[ 39584], 90.00th=[ 59507], 95.00th=[ 83362],
     | 99.00th=[135267], 99.50th=[156238], 99.90th=[206570], 99.95th=[223347],
     | 99.99th=[308282]
   bw (  KiB/s): min= 2464, max=10912, per=100.00%, avg=6138.26, stdev=204.43, samples=390
   iops        : min=  154, max=  682, avg=383.64, stdev=12.78, samples=390
  write: IOPS=394, BW=6313KiB/s (6464kB/s)(124MiB/20038msec); 0 zone resets
    clat (usec): min=265, max=8176, avg=860.81, stdev=656.85
     lat (usec): min=266, max=8177, avg=861.20, stdev=656.84
    clat percentiles (usec):
     |  1.00th=[  297],  5.00th=[  334], 10.00th=[  400], 20.00th=[  420],
     | 30.00th=[  437], 40.00th=[  469], 50.00th=[  611], 60.00th=[  742],
     | 70.00th=[  947], 80.00th=[ 1237], 90.00th=[ 1663], 95.00th=[ 2245],
     | 99.00th=[ 3326], 99.50th=[ 3785], 99.90th=[ 4883], 99.95th=[ 5473],
     | 99.99th=[ 8160]
   bw (  KiB/s): min= 1760, max=12864, per=100.00%, avg=6376.21, stdev=275.57, samples=390
   iops        : min=  110, max=  804, avg=398.51, stdev=17.22, samples=390
  lat (usec)   : 50=0.03%, 500=22.19%, 750=9.33%, 1000=6.18%
  lat (msec)   : 2=11.55%, 4=6.52%, 10=12.54%, 20=11.64%, 50=13.19%
  lat (msec)   : 100=5.38%, 250=1.43%, 500=0.02%
  cpu          : usr=0.02%, sys=0.08%, ctx=15541, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7623,7906,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6087KiB/s (6233kB/s), 6087KiB/s-6087KiB/s (6233kB/s-6233kB/s), io=119MiB (125MB), run=20038-20038msec
  WRITE: bw=6313KiB/s (6464kB/s), 6313KiB/s-6313KiB/s (6464kB/s-6464kB/s), io=124MiB (130MB), run=20038-20038msec

Disk stats (read/write):
  sdd: ios=7712/7906, merge=0/0, ticks=193115/6750, in_queue=200061, util=99.06%
==================  NO.4 non-system disk End ====================
Begin NO.5 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sde -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_5

mytest_5: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_5: (groupid=0, jobs=10): err= 0: pid=125253: Wed Jan 12 17:09:49 2022
  read: IOPS=386, BW=6178KiB/s (6326kB/s)(121MiB/20040msec)
    clat (usec): min=49, max=306599, avg=24927.87, stdev=27703.49
     lat (usec): min=49, max=306599, avg=24928.34, stdev=27703.52
    clat percentiles (usec):
     |  1.00th=[   570],  5.00th=[  2671], 10.00th=[  3884], 20.00th=[  6194],
     | 30.00th=[  8586], 40.00th=[ 11338], 50.00th=[ 15795], 60.00th=[ 20579],
     | 70.00th=[ 27395], 80.00th=[ 38011], 90.00th=[ 57410], 95.00th=[ 80217],
     | 99.00th=[131597], 99.50th=[154141], 99.90th=[250610], 99.95th=[291505],
     | 99.99th=[308282]
   bw (  KiB/s): min= 2263, max=10361, per=100.00%, avg=6217.51, stdev=196.94, samples=391
   iops        : min=  133, max=  645, avg=383.12, stdev=12.49, samples=391
  write: IOPS=401, BW=6422KiB/s (6576kB/s)(126MiB/20040msec); 0 zone resets
    clat (usec): min=263, max=6746, avg=893.02, stdev=707.48
     lat (usec): min=264, max=6747, avg=893.77, stdev=707.54
    clat percentiles (usec):
     |  1.00th=[  297],  5.00th=[  334], 10.00th=[  383], 20.00th=[  404],
     | 30.00th=[  424], 40.00th=[  469], 50.00th=[  611], 60.00th=[  766],
     | 70.00th=[  996], 80.00th=[ 1319], 90.00th=[ 1778], 95.00th=[ 2376],
     | 99.00th=[ 3556], 99.50th=[ 3916], 99.90th=[ 4948], 99.95th=[ 5473],
     | 99.99th=[ 6718]
   bw (  KiB/s): min= 1688, max=12474, per=100.00%, avg=6453.37, stdev=272.57, samples=391
   iops        : min=   98, max=  778, avg=397.89, stdev=17.17, samples=391
  lat (usec)   : 50=0.01%, 100=0.03%, 500=22.08%, 750=8.90%, 1000=5.79%
  lat (msec)   : 2=11.87%, 4=7.19%, 10=12.44%, 20=11.69%, 50=13.62%
  lat (msec)   : 100=5.15%, 250=1.19%, 500=0.05%
  cpu          : usr=0.06%, sys=0.23%, ctx=15787, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7738,8044,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6178KiB/s (6326kB/s), 6178KiB/s-6178KiB/s (6326kB/s-6326kB/s), io=121MiB (127MB), run=20040-20040msec
  WRITE: bw=6422KiB/s (6576kB/s), 6422KiB/s-6422KiB/s (6576kB/s-6576kB/s), io=126MiB (132MB), run=20040-20040msec

Disk stats (read/write):
  sde: ios=7789/8024, merge=0/0, ticks=191129/6956, in_queue=198523, util=99.78%
==================  NO.5 non-system disk End ====================
Begin NO.6 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdf -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_6

mytest_6: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_6: (groupid=0, jobs=10): err= 0: pid=126743: Wed Jan 12 17:10:10 2022
  read: IOPS=434, BW=6948KiB/s (7115kB/s)(136MiB/20055msec)
    clat (usec): min=51, max=242487, avg=22303.72, stdev=25063.34
     lat (usec): min=51, max=242487, avg=22304.26, stdev=25063.34
    clat percentiles (usec):
     |  1.00th=[   326],  5.00th=[  1958], 10.00th=[  3130], 20.00th=[  5276],
     | 30.00th=[  7439], 40.00th=[  9634], 50.00th=[ 13698], 60.00th=[ 18220],
     | 70.00th=[ 25035], 80.00th=[ 34341], 90.00th=[ 52691], 95.00th=[ 72877],
     | 99.00th=[122160], 99.50th=[143655], 99.90th=[191890], 99.95th=[217056],
     | 99.99th=[242222]
   bw (  KiB/s): min= 2967, max=11375, per=100.00%, avg=6966.04, stdev=193.67, samples=392
   iops        : min=  177, max=  706, avg=429.48, stdev=12.14, samples=392
  write: IOPS=451, BW=7227KiB/s (7401kB/s)(142MiB/20055msec); 0 zone resets
    clat (usec): min=262, max=12934, avg=652.93, stdev=399.86
     lat (usec): min=263, max=12935, avg=653.74, stdev=399.86
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  302], 10.00th=[  322], 20.00th=[  338],
     | 30.00th=[  355], 40.00th=[  429], 50.00th=[  545], 60.00th=[  701],
     | 70.00th=[  766], 80.00th=[  914], 90.00th=[ 1123], 95.00th=[ 1336],
     | 99.00th=[ 1942], 99.50th=[ 2180], 99.90th=[ 2606], 99.95th=[ 3097],
     | 99.99th=[12911]
   bw (  KiB/s): min= 2646, max=14828, per=100.00%, avg=7271.81, stdev=273.16, samples=392
   iops        : min=  156, max=  922, avg=448.61, stdev=17.11, samples=392
  lat (usec)   : 100=0.03%, 250=0.01%, 500=24.62%, 750=10.94%, 1000=8.75%
  lat (msec)   : 2=8.73%, 4=4.79%, 10=13.51%, 20=10.36%, 50=12.90%
  lat (msec)   : 100=4.39%, 250=0.96%
  cpu          : usr=0.08%, sys=0.29%, ctx=17840, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8709,9059,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6948KiB/s (7115kB/s), 6948KiB/s-6948KiB/s (7115kB/s-7115kB/s), io=136MiB (143MB), run=20055-20055msec
  WRITE: bw=7227KiB/s (7401kB/s), 7227KiB/s-7227KiB/s (7401kB/s-7401kB/s), io=142MiB (148MB), run=20055-20055msec

Disk stats (read/write):
  sdf: ios=8737/9023, merge=0/0, ticks=192375/5720, in_queue=198324, util=99.73%
==================  NO.6 non-system disk End ====================
Begin NO.7 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdg -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_7

mytest_7: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_7: (groupid=0, jobs=10): err= 0: pid=128173: Wed Jan 12 17:10:32 2022
  read: IOPS=381, BW=6097KiB/s (6243kB/s)(119MiB/20029msec)
    clat (usec): min=56, max=382864, avg=25308.21, stdev=28964.09
     lat (usec): min=56, max=382865, avg=25308.80, stdev=28964.09
    clat percentiles (usec):
     |  1.00th=[   562],  5.00th=[  2540], 10.00th=[  3818], 20.00th=[  6128],
     | 30.00th=[  8455], 40.00th=[ 11207], 50.00th=[ 15664], 60.00th=[ 20317],
     | 70.00th=[ 27395], 80.00th=[ 39060], 90.00th=[ 58983], 95.00th=[ 81265],
     | 99.00th=[139461], 99.50th=[164627], 99.90th=[246416], 99.95th=[261096],
     | 99.99th=[383779]
   bw (  KiB/s): min= 2007, max=10696, per=100.00%, avg=6135.51, stdev=212.65, samples=390
   iops        : min=  117, max=  661, avg=376.36, stdev=13.40, samples=390
  write: IOPS=395, BW=6326KiB/s (6478kB/s)(124MiB/20029msec); 0 zone resets
    clat (usec): min=257, max=6562, avg=871.49, stdev=682.48
     lat (usec): min=257, max=6563, avg=872.41, stdev=682.48
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  322], 10.00th=[  363], 20.00th=[  400],
     | 30.00th=[  420], 40.00th=[  465], 50.00th=[  619], 60.00th=[  758],
     | 70.00th=[  979], 80.00th=[ 1287], 90.00th=[ 1745], 95.00th=[ 2278],
     | 99.00th=[ 3425], 99.50th=[ 3818], 99.90th=[ 5276], 99.95th=[ 5800],
     | 99.99th=[ 6587]
   bw (  KiB/s): min= 1590, max=13421, per=100.00%, avg=6395.86, stdev=285.51, samples=389
   iops        : min=   90, max=  834, avg=392.64, stdev=17.96, samples=389
  lat (usec)   : 100=0.03%, 500=22.32%, 750=8.91%, 1000=5.88%
  lat (msec)   : 2=11.93%, 4=7.00%, 10=12.40%, 20=11.68%, 50=13.16%
  lat (msec)   : 100=5.21%, 250=1.45%, 500=0.05%
  cpu          : usr=0.07%, sys=0.30%, ctx=15595, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7632,7919,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6097KiB/s (6243kB/s), 6097KiB/s-6097KiB/s (6243kB/s-6243kB/s), io=119MiB (125MB), run=20029-20029msec
  WRITE: bw=6326KiB/s (6478kB/s), 6326KiB/s-6326KiB/s (6478kB/s-6478kB/s), io=124MiB (130MB), run=20029-20029msec

Disk stats (read/write):
  sdg: ios=7668/7888, merge=0/0, ticks=191446/6673, in_queue=198322, util=99.77%
==================  NO.7 non-system disk End ====================
Begin NO.8 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdh -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_8

mytest_8: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_8: (groupid=0, jobs=10): err= 0: pid=129650: Wed Jan 12 17:10:53 2022
  read: IOPS=432, BW=6925KiB/s (7091kB/s)(136MiB/20036msec)
    clat (usec): min=53, max=311723, avg=22407.79, stdev=25403.47
     lat (usec): min=53, max=311723, avg=22408.33, stdev=25403.46
    clat percentiles (usec):
     |  1.00th=[   322],  5.00th=[  1844], 10.00th=[  3097], 20.00th=[  5211],
     | 30.00th=[  7373], 40.00th=[  9765], 50.00th=[ 13566], 60.00th=[ 18220],
     | 70.00th=[ 25297], 80.00th=[ 34341], 90.00th=[ 52167], 95.00th=[ 72877],
     | 99.00th=[123208], 99.50th=[143655], 99.90th=[212861], 99.95th=[231736],
     | 99.99th=[312476]
   bw (  KiB/s): min= 3552, max=10901, per=100.00%, avg=6937.68, stdev=173.41, samples=394
   iops        : min=  222, max=  678, avg=432.50, stdev=10.78, samples=394
  write: IOPS=448, BW=7181KiB/s (7353kB/s)(141MiB/20036msec); 0 zone resets
    clat (usec): min=264, max=9502, avg=645.94, stdev=378.58
     lat (usec): min=264, max=9503, avg=646.76, stdev=378.59
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  302], 10.00th=[  318], 20.00th=[  338],
     | 30.00th=[  351], 40.00th=[  412], 50.00th=[  537], 60.00th=[  701],
     | 70.00th=[  766], 80.00th=[  898], 90.00th=[ 1106], 95.00th=[ 1287],
     | 99.00th=[ 1958], 99.50th=[ 2147], 99.90th=[ 2671], 99.95th=[ 2900],
     | 99.99th=[ 9503]
   bw (  KiB/s): min= 2462, max=13976, per=100.00%, avg=7210.37, stdev=269.89, samples=394
   iops        : min=  152, max=  872, avg=449.56, stdev=16.83, samples=394
  lat (usec)   : 100=0.03%, 500=24.88%, 750=11.16%, 1000=8.62%
  lat (msec)   : 2=8.46%, 4=4.92%, 10=12.99%, 20=10.79%, 50=12.68%
  lat (msec)   : 100=4.53%, 250=0.92%, 500=0.02%
  cpu          : usr=0.09%, sys=0.28%, ctx=17718, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8672,8992,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6925KiB/s (7091kB/s), 6925KiB/s-6925KiB/s (7091kB/s-7091kB/s), io=136MiB (142MB), run=20036-20036msec
  WRITE: bw=7181KiB/s (7353kB/s), 7181KiB/s-7181KiB/s (7353kB/s-7353kB/s), io=141MiB (147MB), run=20036-20036msec

Disk stats (read/write):
  sdh: ios=8666/8947, merge=0/0, ticks=192564/5559, in_queue=198321, util=99.78%
==================  NO.8 non-system disk End ====================
Begin NO.9 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdi -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_9

mytest_9: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_9: (groupid=0, jobs=10): err= 0: pid=131156: Wed Jan 12 17:11:14 2022
  read: IOPS=379, BW=6072KiB/s (6217kB/s)(119MiB/20043msec)
    clat (usec): min=71, max=296152, avg=25438.52, stdev=28903.10
     lat (usec): min=72, max=296153, avg=25439.11, stdev=28903.10
    clat percentiles (usec):
     |  1.00th=[   553],  5.00th=[  2737], 10.00th=[  3884], 20.00th=[  6128],
     | 30.00th=[  8586], 40.00th=[ 11469], 50.00th=[ 15664], 60.00th=[ 20317],
     | 70.00th=[ 27395], 80.00th=[ 38536], 90.00th=[ 59507], 95.00th=[ 81265],
     | 99.00th=[143655], 99.50th=[168821], 99.90th=[225444], 99.95th=[238027],
     | 99.99th=[295699]
   bw (  KiB/s): min= 2427, max=10368, per=100.00%, avg=6112.61, stdev=206.82, samples=393
   iops        : min=  147, max=  648, avg=381.03, stdev=13.03, samples=393
  write: IOPS=393, BW=6290KiB/s (6441kB/s)(123MiB/20043msec); 0 zone resets
    clat (usec): min=269, max=17696, avg=836.80, stdev=679.09
     lat (usec): min=270, max=17697, avg=837.69, stdev=679.09
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  314], 10.00th=[  359], 20.00th=[  396],
     | 30.00th=[  416], 40.00th=[  445], 50.00th=[  578], 60.00th=[  734],
     | 70.00th=[  914], 80.00th=[ 1237], 90.00th=[ 1631], 95.00th=[ 2180],
     | 99.00th=[ 3425], 99.50th=[ 3916], 99.90th=[ 5014], 99.95th=[ 5800],
     | 99.99th=[17695]
   bw (  KiB/s): min= 1375, max=13408, per=100.00%, avg=6355.37, stdev=280.51, samples=392
   iops        : min=   85, max=  838, avg=396.23, stdev=17.60, samples=392
  lat (usec)   : 100=0.03%, 500=23.71%, 750=8.20%, 1000=6.50%
  lat (msec)   : 2=11.04%, 4=6.38%, 10=12.32%, 20=11.89%, 50=13.21%
  lat (msec)   : 100=5.27%, 250=1.43%, 500=0.02%
  cpu          : usr=0.08%, sys=0.27%, ctx=15505, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7606,7879,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6072KiB/s (6217kB/s), 6072KiB/s-6072KiB/s (6217kB/s-6217kB/s), io=119MiB (125MB), run=20043-20043msec
  WRITE: bw=6290KiB/s (6441kB/s), 6290KiB/s-6290KiB/s (6441kB/s-6441kB/s), io=123MiB (129MB), run=20043-20043msec

Disk stats (read/write):
  sdi: ios=7607/7842, merge=0/0, ticks=191569/6379, in_queue=198324, util=99.78%
==================  NO.9 non-system disk End ====================
Begin NO.10 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdj -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_10

mytest_10: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_10: (groupid=0, jobs=10): err= 0: pid=132604: Wed Jan 12 17:11:35 2022
  read: IOPS=358, BW=5737KiB/s (5875kB/s)(112MiB/20025msec)
    clat (usec): min=78, max=213816, avg=21322.95, stdev=22118.64
     lat (usec): min=79, max=213817, avg=21323.58, stdev=22118.65
    clat percentiles (usec):
     |  1.00th=[   396],  5.00th=[  2704], 10.00th=[  3851], 20.00th=[  6063],
     | 30.00th=[  8291], 40.00th=[ 10421], 50.00th=[ 14091], 60.00th=[ 17957],
     | 70.00th=[ 23987], 80.00th=[ 32900], 90.00th=[ 48497], 95.00th=[ 65799],
     | 99.00th=[105382], 99.50th=[126354], 99.90th=[179307], 99.95th=[200279],
     | 99.99th=[212861]
   bw (  KiB/s): min= 1977, max=10740, per=100.00%, avg=5797.18, stdev=231.45, samples=390
   iops        : min=  117, max=  667, avg=356.56, stdev=14.51, samples=390
  write: IOPS=370, BW=5936KiB/s (6078kB/s)(116MiB/20025msec); 0 zone resets
    clat (usec): min=265, max=92707, avg=6326.20, stdev=12595.92
     lat (usec): min=265, max=92708, avg=6327.20, stdev=12596.02
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  306], 10.00th=[  326], 20.00th=[  338],
     | 30.00th=[  359], 40.00th=[  453], 50.00th=[  635], 60.00th=[  865],
     | 70.00th=[ 1287], 80.00th=[ 9241], 90.00th=[26346], 95.00th=[36439],
     | 99.00th=[53740], 99.50th=[61604], 99.90th=[77071], 99.95th=[85459],
     | 99.99th=[92799]
   bw (  KiB/s): min= 1883, max=13229, per=100.00%, avg=6023.49, stdev=286.95, samples=390
   iops        : min=  113, max=  822, avg=370.72, stdev=17.96, samples=390
  lat (usec)   : 100=0.01%, 250=0.02%, 500=22.59%, 750=6.87%, 1000=4.49%
  lat (msec)   : 2=6.01%, 4=4.52%, 10=15.02%, 20=16.01%, 50=19.10%
  lat (msec)   : 100=4.76%, 250=0.59%
  cpu          : usr=0.07%, sys=0.29%, ctx=14676, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7180,7429,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5737KiB/s (5875kB/s), 5737KiB/s-5737KiB/s (5875kB/s-5875kB/s), io=112MiB (118MB), run=20025-20025msec
  WRITE: bw=5936KiB/s (6078kB/s), 5936KiB/s-5936KiB/s (6078kB/s-6078kB/s), io=116MiB (122MB), run=20025-20025msec

Disk stats (read/write):
  sdj: ios=7228/7409, merge=0/0, ticks=152268/45941, in_queue=198236, util=99.74%
==================  NO.10 non-system disk End ====================
Begin NO.11 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdk -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_11

mytest_11: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_11: (groupid=0, jobs=10): err= 0: pid=134079: Wed Jan 12 17:11:56 2022
  read: IOPS=357, BW=5714KiB/s (5851kB/s)(112MiB/20038msec)
    clat (usec): min=58, max=209462, avg=21334.49, stdev=21436.37
     lat (usec): min=58, max=209462, avg=21335.07, stdev=21436.37
    clat percentiles (usec):
     |  1.00th=[   355],  5.00th=[  2704], 10.00th=[  4015], 20.00th=[  6259],
     | 30.00th=[  8455], 40.00th=[ 10814], 50.00th=[ 14484], 60.00th=[ 18220],
     | 70.00th=[ 24249], 80.00th=[ 33162], 90.00th=[ 48497], 95.00th=[ 63701],
     | 99.00th=[103285], 99.50th=[119014], 99.90th=[173016], 99.95th=[196084],
     | 99.99th=[208667]
   bw (  KiB/s): min= 1623, max=10510, per=100.00%, avg=5778.31, stdev=237.47, samples=390
   iops        : min=   93, max=  651, avg=354.21, stdev=14.94, samples=390
  write: IOPS=371, BW=5940KiB/s (6082kB/s)(116MiB/20038msec); 0 zone resets
    clat (usec): min=261, max=96697, avg=6380.84, stdev=12759.11
     lat (usec): min=261, max=96697, avg=6381.73, stdev=12759.21
    clat percentiles (usec):
     |  1.00th=[  285],  5.00th=[  306], 10.00th=[  326], 20.00th=[  343],
     | 30.00th=[  363], 40.00th=[  469], 50.00th=[  652], 60.00th=[  873],
     | 70.00th=[ 1303], 80.00th=[ 8979], 90.00th=[25822], 95.00th=[36963],
     | 99.00th=[55313], 99.50th=[62653], 99.90th=[83362], 99.95th=[86508],
     | 99.99th=[96994]
   bw (  KiB/s): min= 1880, max=13575, per=100.00%, avg=6017.05, stdev=287.60, samples=390
   iops        : min=  110, max=  842, avg=369.13, stdev=18.09, samples=390
  lat (usec)   : 100=0.03%, 250=0.01%, 500=22.20%, 750=7.18%, 1000=4.57%
  lat (msec)   : 2=6.12%, 4=4.31%, 10=14.48%, 20=16.22%, 50=19.48%
  lat (msec)   : 100=4.83%, 250=0.56%
  cpu          : usr=0.07%, sys=0.26%, ctx=14654, majf=0, minf=41
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7156,7439,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5714KiB/s (5851kB/s), 5714KiB/s-5714KiB/s (5851kB/s-5851kB/s), io=112MiB (117MB), run=20038-20038msec
  WRITE: bw=5940KiB/s (6082kB/s), 5940KiB/s-5940KiB/s (6082kB/s-6082kB/s), io=116MiB (122MB), run=20038-20038msec

Disk stats (read/write):
  sdk: ios=7210/7419, merge=0/0, ticks=151826/46481, in_queue=198340, util=99.73%
==================  NO.11 non-system disk End ====================
Begin NO.12 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/sdl -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_12

mytest_12: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_12: (groupid=0, jobs=10): err= 0: pid=135513: Wed Jan 12 17:12:17 2022
  read: IOPS=356, BW=5710KiB/s (5847kB/s)(112MiB/20013msec)
    clat (usec): min=64, max=257159, avg=21340.77, stdev=22914.52
     lat (usec): min=65, max=257160, avg=21341.39, stdev=22914.52
    clat percentiles (usec):
     |  1.00th=[   355],  5.00th=[  2573], 10.00th=[  3818], 20.00th=[  5997],
     | 30.00th=[  8160], 40.00th=[ 10421], 50.00th=[ 13698], 60.00th=[ 17695],
     | 70.00th=[ 23462], 80.00th=[ 32637], 90.00th=[ 49021], 95.00th=[ 66847],
     | 99.00th=[109577], 99.50th=[137364], 99.90th=[166724], 99.95th=[204473],
     | 99.99th=[256902]
   bw (  KiB/s): min= 1439, max=11121, per=100.00%, avg=5757.51, stdev=250.52, samples=390
   iops        : min=   89, max=  691, avg=355.95, stdev=15.62, samples=390
  write: IOPS=369, BW=5904KiB/s (6046kB/s)(115MiB/20013msec); 0 zone resets
    clat (usec): min=267, max=101727, avg=6440.42, stdev=12981.61
     lat (usec): min=268, max=101727, avg=6441.53, stdev=12981.69
    clat percentiles (usec):
     |  1.00th=[   289],  5.00th=[   310], 10.00th=[   330], 20.00th=[   343],
     | 30.00th=[   359], 40.00th=[   461], 50.00th=[   635], 60.00th=[   857],
     | 70.00th=[  1287], 80.00th=[  8979], 90.00th=[ 26608], 95.00th=[ 36963],
     | 99.00th=[ 55313], 99.50th=[ 63177], 99.90th=[ 80217], 99.95th=[ 86508],
     | 99.99th=[102237]
   bw (  KiB/s): min= 2045, max=13620, per=100.00%, avg=5965.95, stdev=293.49, samples=390
   iops        : min=  125, max=  848, avg=368.97, stdev=18.32, samples=390
  lat (usec)   : 100=0.01%, 250=0.01%, 500=22.52%, 750=6.91%, 1000=4.62%
  lat (msec)   : 2=6.39%, 4=4.47%, 10=14.83%, 20=16.15%, 50=18.47%
  lat (msec)   : 100=4.87%, 250=0.72%, 500=0.01%
  cpu          : usr=0.08%, sys=0.28%, ctx=14560, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7142,7385,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5710KiB/s (5847kB/s), 5710KiB/s-5710KiB/s (5847kB/s-5847kB/s), io=112MiB (117MB), run=20013-20013msec
  WRITE: bw=5904KiB/s (6046kB/s), 5904KiB/s-5904KiB/s (6046kB/s-6046kB/s), io=115MiB (121MB), run=20013-20013msec

Disk stats (read/write):
  sdl: ios=7156/7362, merge=0/0, ticks=151579/46571, in_queue=198244, util=99.76%
==================  NO.12 non-system disk End ====================
Begin NO.13 the non-system disk read and write
The Command Line ->>> fio -filename=/dev/nvme1n1 -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_13

mytest_13: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_13: (groupid=0, jobs=10): err= 0: pid=137085: Wed Jan 12 17:12:36 2022
  read: IOPS=37.7k, BW=590MiB/s (618MB/s)(10.0GiB/17370msec)
    clat (usec): min=15, max=17177, avg=229.00, stdev=112.42
     lat (usec): min=15, max=17177, avg=229.14, stdev=112.42
    clat percentiles (usec):
     |  1.00th=[  114],  5.00th=[  128], 10.00th=[  135], 20.00th=[  155],
     | 30.00th=[  174], 40.00th=[  194], 50.00th=[  208], 60.00th=[  233],
     | 70.00th=[  255], 80.00th=[  289], 90.00th=[  343], 95.00th=[  392],
     | 99.00th=[  494], 99.50th=[  545], 99.90th=[ 1172], 99.95th=[ 1827],
     | 99.99th=[ 2737]
   bw (  KiB/s): min=595667, max=625002, per=100.00%, avg=609465.53, stdev=681.18, samples=340
   iops        : min=37226, max=39062, avg=38089.47, stdev=42.61, samples=340
  write: IOPS=37.7k, BW=589MiB/s (618MB/s)(9.00GiB/17370msec); 0 zone resets
    clat (usec): min=14, max=17095, avg=30.75, stdev=62.83
     lat (usec): min=15, max=17095, avg=31.26, stdev=62.83
    clat percentiles (usec):
     |  1.00th=[   21],  5.00th=[   26], 10.00th=[   26], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   29], 50.00th=[   29], 60.00th=[   30],
     | 70.00th=[   32], 80.00th=[   34], 90.00th=[   38], 95.00th=[   42],
     | 99.00th=[   50], 99.50th=[   55], 99.90th=[   67], 99.95th=[   79],
     | 99.99th=[  108]
   bw (  KiB/s): min=570934, max=648496, per=100.00%, avg=609273.82, stdev=1746.77, samples=340
   iops        : min=35680, max=40525, avg=38077.24, stdev=109.22, samples=340
  lat (usec)   : 20=0.44%, 50=49.15%, 100=0.51%, 250=33.88%, 500=15.55%
  lat (usec)   : 750=0.39%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.02%, 10=0.01%, 20=0.01%
  cpu          : usr=2.67%, sys=9.10%, ctx=1310944, majf=0, minf=309
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=655466,655254,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=590MiB/s (618MB/s), 590MiB/s-590MiB/s (618MB/s-618MB/s), io=10.0GiB (10.7GB), run=17370-17370msec
  WRITE: bw=589MiB/s (618MB/s), 589MiB/s-589MiB/s (618MB/s-618MB/s), io=9.00GiB (10.7GB), run=17370-17370msec

Disk stats (read/write):
  nvme1n1: ios=651885/651527, merge=0/0, ticks=140982/11337, in_queue=152319, util=99.71%
==================  NO.13 non-system disk End ====================
->>> 13 non-system disks have been read and written End
->>> System Disk is : nvme0n1
============ System Disk Read Begin  2022-01-12 17:12:57 ==============
The Command Line->>> fio -directory=/test -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=2G -numjobs=10 -runtime=20 -group_reporting -name=mytest_0

mytest_0: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.20
Starting 10 threads

mytest_0: (groupid=0, jobs=10): err= 0: pid=138246: Wed Jan 12 17:12:57 2022
  read: IOPS=55.5k, BW=867MiB/s (909MB/s)(16.9GiB/20001msec)
    clat (usec): min=66, max=1738, avg=178.73, stdev=55.40
     lat (usec): min=66, max=1738, avg=178.86, stdev=55.40
    clat percentiles (usec):
     |  1.00th=[   95],  5.00th=[  114], 10.00th=[  122], 20.00th=[  133],
     | 30.00th=[  143], 40.00th=[  155], 50.00th=[  172], 60.00th=[  186],
     | 70.00th=[  196], 80.00th=[  217], 90.00th=[  251], 95.00th=[  285],
     | 99.00th=[  359], 99.50th=[  388], 99.90th=[  461], 99.95th=[  498],
     | 99.99th=[  570]
   bw (  KiB/s): min=874688, max=902666, per=100.00%, avg=888393.13, stdev=661.38, samples=390
   iops        : min=54668, max=56416, avg=55523.56, stdev=41.33, samples=390
  lat (usec)   : 100=1.59%, 250=88.14%, 500=10.22%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.75%, sys=8.54%, ctx=1110172, majf=0, minf=454
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1109943,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=867MiB/s (909MB/s), 867MiB/s-867MiB/s (909MB/s-909MB/s), io=16.9GiB (18.2GB), run=20001-20001msec

Disk stats (read/write):
    dm-0: ios=1103457/0, merge=0/0, ticks=180240/0, in_queue=181133, util=100.00%, aggrios=1109943/5, aggrmerge=0/0, aggrticks=180196/0, aggrin_queue=180196, aggrutil=99.72%
  nvme0n1: ios=1109943/5, merge=0/0, ticks=180196/0, in_queue=180196, util=99.72%
==============  System Disk Read End  2022-01-12 17:12:57 =================